cases/3/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
	
	porewalls
    {
		type			constantAlphaContactAngle;
		value			uniform 1;
		theta0			0;
		limit			gradient;
    }
	walls
    {
		type			constantAlphaContactAngle;
		value			uniform 1;
		theta0			0;
		limit			gradient;
    }
	
    inlet
    {
        type            fixedValue;
        value uniform         0.0;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

	
    frontAndBack
    {
        type            empty;
    }

	movingWalls_patch0
    {
		type			constantAlphaContactAngle;
		value			uniform 1;
		theta0			0;
		limit			gradient;
}


// ************************************************************************* //
