cases/3/system/internalCloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified cloud of points.

\*---------------------------------------------------------------------------*/

points
(
(0.0000000000 0.0000000000 2e-05) 
(0.0000393701 0.0000000000 2e-05) 
(0.0000787402 0.0000000000 2e-05) 
(0.0001181103 0.0000000000 2e-05) 
(0.0001574804 0.0000000000 2e-05) 
(0.0001968505 0.0000000000 2e-05) 
(0.0002362206 0.0000000000 2e-05) 
(0.0002755907 0.0000000000 2e-05) 
(0.0003149608 0.0000000000 2e-05) 
(0.0003543309 0.0000000000 2e-05) 
(0.0003937010 0.0000000000 2e-05) 
(0.0004330711 0.0000000000 2e-05) 
(0.0004724412 0.0000000000 2e-05) 
(0.0005118113 0.0000000000 2e-05) 
(0.0005511814 0.0000000000 2e-05) 
(0.0005905515 0.0000000000 2e-05) 
(0.0006299216 0.0000000000 2e-05) 
(0.0006692917 0.0000000000 2e-05) 
(0.0007086618 0.0000000000 2e-05) 
(0.0007480319 0.0000000000 2e-05) 
(0.0007874020 0.0000000000 2e-05) 
(0.0008267721 0.0000000000 2e-05) 
(0.0008661422 0.0000000000 2e-05) 
(0.0009055123 0.0000000000 2e-05) 
(0.0009448824 0.0000000000 2e-05) 
(0.0009842525 0.0000000000 2e-05) 
(0.0010236226 0.0000000000 2e-05) 
(0.0010629927 0.0000000000 2e-05) 
(0.0011023628 0.0000000000 2e-05) 
(0.0011417329 0.0000000000 2e-05) 
(0.0011811030 0.0000000000 2e-05) 
(0.0012204731 0.0000000000 2e-05) 
(0.0012598432 0.0000000000 2e-05) 
(0.0012992133 0.0000000000 2e-05) 
(0.0013385834 0.0000000000 2e-05) 
(0.0013779535 0.0000000000 2e-05) 
(0.0014173236 0.0000000000 2e-05) 
(0.0014566937 0.0000000000 2e-05) 
(0.0014960638 0.0000000000 2e-05) 
(0.0015354339 0.0000000000 2e-05) 
(0.0015748040 0.0000000000 2e-05) 
(0.0016141741 0.0000000000 2e-05) 
(0.0016535442 0.0000000000 2e-05) 
(0.0016929143 0.0000000000 2e-05) 
(0.0017322844 0.0000000000 2e-05) 
(0.0017716545 0.0000000000 2e-05) 
(0.0018110246 0.0000000000 2e-05) 
(0.0018503947 0.0000000000 2e-05) 
(0.0018897648 0.0000000000 2e-05) 
(0.0019291349 0.0000000000 2e-05) 
(0.0019685050 0.0000000000 2e-05) 
(0.0020078751 0.0000000000 2e-05) 
(0.0020472452 0.0000000000 2e-05) 
(0.0020866153 0.0000000000 2e-05) 
(0.0021259854 0.0000000000 2e-05) 
(0.0021653555 0.0000000000 2e-05) 
(0.0022047256 0.0000000000 2e-05) 
(0.0022440957 0.0000000000 2e-05) 
(0.0022834658 0.0000000000 2e-05) 
(0.0023228359 0.0000000000 2e-05) 
(0.0023622060 0.0000000000 2e-05) 
(0.0024015761 0.0000000000 2e-05) 
(0.0024409462 0.0000000000 2e-05) 
(0.0024803163 0.0000000000 2e-05) 
(0.0025196864 0.0000000000 2e-05) 
(0.0025590565 0.0000000000 2e-05) 
(0.0025984266 0.0000000000 2e-05) 
(0.0026377967 0.0000000000 2e-05) 
(0.0026771668 0.0000000000 2e-05) 
(0.0027165369 0.0000000000 2e-05) 
(0.0027559070 0.0000000000 2e-05) 
(0.0027952771 0.0000000000 2e-05) 
(0.0028346472 0.0000000000 2e-05) 
(0.0028740173 0.0000000000 2e-05) 
(0.0029133874 0.0000000000 2e-05) 
(0.0029527575 0.0000000000 2e-05) 
(0.0029921276 0.0000000000 2e-05) 
(0.0030314977 0.0000000000 2e-05) 
(0.0030708678 0.0000000000 2e-05) 
(0.0031102379 0.0000000000 2e-05) 
(0.0031496080 0.0000000000 2e-05) 
(0.0031889781 0.0000000000 2e-05) 
(0.0032283482 0.0000000000 2e-05) 
(0.0032677183 0.0000000000 2e-05) 
(0.0033070884 0.0000000000 2e-05) 
(0.0033464585 0.0000000000 2e-05) 
(0.0033858286 0.0000000000 2e-05) 
(0.0034251987 0.0000000000 2e-05) 
(0.0034645688 0.0000000000 2e-05) 
(0.0035039389 0.0000000000 2e-05) 
(0.0035433090 0.0000000000 2e-05) 
(0.0035826791 0.0000000000 2e-05) 
(0.0036220492 0.0000000000 2e-05) 
(0.0036614193 0.0000000000 2e-05) 
(0.0037007894 0.0000000000 2e-05) 
(0.0037401595 0.0000000000 2e-05) 
(0.0037795296 0.0000000000 2e-05) 
(0.0038188997 0.0000000000 2e-05) 
(0.0038582698 0.0000000000 2e-05) 
...
);

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
setFormat	raw;

executeControl  writeTime;
writeControl    writeTime;

sets
(
cloud
{
        type    points;
	ordered	no;
        axis    xyz;
        points  $points;
    }
);


fields (p U);

// ************************************************************************* //
