cases/3/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
// 6-actions patch generation: cut out 'filter1' from 'ceiling' 
    { 
        name    filter1; 
        type    faceSet; 
        action  new; 
        source  patchToFace; 
        sourceInfo 
        { 
            name "default"; 
        } 
    } 
    // cutting volume for inlet 
    { 
        name    tempset1; 
        type    cellSet; 
        action  new; 
        source  boxToCell; 
        sourceInfo 
        { 
            box (49.916666 -0.1 -0.01)(50.01 50.01 0.41); 
        } 
    } 
    // taking faces belonging to the cutting volume 
    { 
        name    tempset2; 
        type    faceSet; 
        action  new; 
        source  cellToFace; 
        sourceInfo 
        { 
            set        tempset1; 
            option    all;    //Is there not better option, like only selecting boundary faces? 
        } 
    } 
    // temporary clone of ceiling-face-zone 
    { 
        name    tempset3; 
        type    faceSet; 
        action  new; 
        source  faceToFace; 
        sourceInfo 
        { 
            set "filter1"; 
        } 
    } 
    // removing the filter1 faces from the ceiling-faces-clone 
    { 
        name    tempset3; 
        type    faceSet; 
        action  delete; 
        source  faceToFace; 
        sourceInfo 
        { 
            set "tempset2"; 
        } 
    } 
    // final filter1 patch = ceiling-faces - tempset3 
    { 
        name    filter1; //this is the final result to use in createPatchDict ! 
        type    faceSet; 
        action  delete; 
        source  faceToFace; 
        sourceInfo 
        { 
            set "tempset3"; 
        } 
    } 
    //here ends the 6-actions sequence to cut a patch from an existing patch.

);

// ************************************************************************* //
